thermometer_server/app/controllers/thermometers_controller.rb

SELECT "thermometers".* FROM "thermometers"
---
  def index
    @thermometers = Thermometer.all

SELECT  "thermometers".* FROM "thermometers"  WHERE "thermometers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @thermometer = Thermometer.find(params[:id])

INSERT INTO "thermometers" ("created_at", "temperature", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-25 22:56:28.352912"], ["temperature", 1.0], ["updated_at", "2015-03-25 22:56:28.352912"]]
---
  def create
    @thermometer = Thermometer.new(thermometer_params)

    respond_to do |format|
      if @thermometer.save