app/controllers/groceries_controller.rb

SELECT "groceries".* FROM "groceries"
---
  def index
    @groceries = Grocery.all

INSERT INTO "groceries" ("created_at", "dairy", "fruit", "meat", "updated_at", "vegetable") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-03-30 14:17:41.018008"], ["dairy", "milk"], ["fruit", "peach"], ["meat", "chicken"], ["updated_at", "2015-03-30 14:17:41.018008"], ["vegetable", "cauliflower"]]
---
  def create
    @grocery = Grocery.new(grocery_params)
    @grocery.save

SELECT  "groceries".* FROM "groceries"  WHERE "groceries"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_grocery
      @grocery = Grocery.find(params[:id])