app/controllers/thermometers_controller.rb

  def index
    @thermometers = Thermometer.all
---
SELECT "thermometers".* FROM "thermometers"

  def create
    @thermometer = Thermometer.new(thermometer_params)
    binding.pry
    if  @thermometer.save
---
INSERT INTO "thermometers" ("created_at", "location", "maxtemp", "power", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-03-27 00:25:59.922884"], ["location", "bedroom"], ["maxtemp", 80.0], ["power", "t"], ["updated_at", "2015-03-27 00:25:59.922884"]]

  def destroy
    @thermometer.destroy
---
DELETE FROM "thermometers" WHERE "thermometers"."id" = ?  [["id", 2]]

    def set_thermometer
      @thermometer = Thermometer.find(params[:id])
---
SELECT  "thermometers".* FROM "thermometers"  WHERE "thermometers"."id" = ? LIMIT 1  [["id", 2]]